KELOMPOK 5



*   Muhamad Hasbi Ashshiddiqi		(1301190476)
*   Restu Aditya Rachman 			(1301190433)
*   Muhammad Rizqi Ramadhan 		(1301193325)

In [ ]:
!gdown --id 1cKuN4knkQnrX28_k7Wx990ioLZt3aBdV

Downloading...
From: https://drive.google.com/uc?id=1cKuN4knkQnrX28_k7Wx990ioLZt3aBdV
To: /content/mobil.xls
100% 29.2k/29.2k [00:00<00:00, 28.0MB/s]

In [ ]:
import pandas as pd

df = pd.read_excel('mobil.xls')

df.head()

       Nama Mobil  Ukuran  Kenyamanan  Irit  Kecepatan  Harga (Ratus Juta)
0     Toyota Agya       4           4     9          6                1.00
1   Daihatsu Alya       4           3     9          6                1.10
2   Toyota Avanza       6           5     6          6                2.00
3  Daihatsu Xenia       6           4     6          6                1.75
4         Xpander       7           7     6          7                2.25

In [ ]:
df.describe()

          Ukuran  Kenyamanan       Irit  Kecepatan  Harga (Ratus Juta)
count  17.000000   17.000000  17.000000  17.000000           17.000000
mean    6.529412    6.352941   6.941176   6.823529            3.247059
std     2.034627    2.234423   1.784327   1.131111            2.406597
min     3.000000    3.000000   4.000000   5.000000            0.800000
25%     5.000000    4.000000   6.000000   6.000000            1.750000
50%     7.000000    7.000000   7.000000   7.000000            2.300000
75%     8.000000    8.000000   9.000000   8.000000            5.000000
max    10.000000   10.000000  10.000000   9.000000           10.000000

In [ ]:
df.isna().sum()

Nama Mobil            0
Ukuran                0
Kenyamanan            0
Irit                  0
Kecepatan             0
Harga (Ratus Juta)    0
dtype: int64

In [ ]:
df = df.rename({'Nama Mobil':'Mobil'}, axis=1)
df = df.rename({'Harga (Ratus Juta)':'Harga'}, axis=1)
df.head()

            Mobil  Ukuran  Kenyamanan  Irit  Kecepatan  Harga
0     Toyota Agya       4           4     9          6   1.00
1   Daihatsu Alya       4           3     9          6   1.10
2   Toyota Avanza       6           5     6          6   2.00
3  Daihatsu Xenia       6           4     6          6   1.75
4         Xpander       7           7     6          7   2.25

In [ ]:
data_x = df.drop('Mobil', axis=1)
data_y = df['Mobil']

In [ ]:
for col in range(len(data_x)):
    data_x['Harga'][col] = ((data_x['Harga'][col] - (data_x['Harga']).min()) / ((data_x['Harga']).max() - (data_x['Harga']).min()))

data_x.head()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

   Ukuran  Kenyamanan  Irit  Kecepatan     Harga
0       4           4     9          6  0.021739
1       4           3     9          6  0.108061
2       6           5     6          6  0.198257
3       6           4     6          6  0.173203
4       7           7     6          7  0.223312

In [ ]:
def euclidean_distance(data_x, data_input):
    dist = 0
    for i in range(len(data_input)):
        dist += (data_x[i] - data_input[i])**2

    return dist ** (1/2)

def manhattan_distance(data_x, data_input):
    dist = 0
    for i in range(len(data_x)):
        dist += abs(data_x[i] - data_input[i])

    return dist
 
def minkowski_distance(data_x, data_input, p=2):
    dist = 0
    for i in range(len(data_x)):
        dist += abs(data_x[i] - data_input[i]) ** p

    return dist ** (1/p)

def supremum_distance(data_x, data_input):
    dist = []
    for i in range(len(data_x)):
        dist.append(abs(data_x[i] - data_input[i]))

    return max(dist)

In [ ]:
def distance(data_x, data_y, data_input):
    k = 3
    euclidean = []
    manhattan = []
    minkowski = []
    supremum = []

    for index,row in data_x.iterrows():
      euclidean.append([euclidean_distance(row, data_input), data_y[index]])
      manhattan.append([manhattan_distance(row, data_input), data_y[index]])
      minkowski.append([minkowski_distance(row, data_input), data_y[index]])
      supremum.append([supremum_distance(row, data_input), data_y[index]])
    
    euclidean = sorted(euclidean)[:k]
    manhattan = sorted(manhattan)[:k]
    minkowski = sorted(minkowski)[:k]
    supremum = sorted(supremum)[:k]

    return euclidean, manhattan, minkowski, supremum

In [ ]:
euclidean, manhattan, minkowski, supremum = [],[],[],[]

ukuran = int(input("Ukuran: "))
kenyamanan = int(input("Kenyamanan: "))
irit = int(input("Irit: "))
kecepatan = int(input("Kecepatan: "))
harga = int(input("Harga (Ratus Juta): "))

data_input = [ukuran, kenyamanan, irit, kecepatan, harga]

euclidean, manhattan, minkowski, supremum = distance(data_x, data_y, data_input)
distances = {'Euclidean':euclidean, 'Manhattan':manhattan, 'Minkowski':minkowski, 'Supremum':supremum}

rekomendasi = {}
for key,items in distances.items():
  mobil = []
  print(f'\n{key} Distance')
  i = 1
  for item in items:
    print(f'{i}. {item[1]} memiliki jarak {round(item[0],2)}')
    mobil.append(item[1])
    i += 1
  rekomendasi[key] = mobil

df_rekomendasi = pd.DataFrame(rekomendasi)
df_rekomendasi.to_excel("rekomendasi.xls")

Ukuran: 1
Kenyamanan: 2
Irit: 3
Kecepatan: 4
Harga: 5

Euclidean Distance
1. Daihatsu Xenia memiliki jarak 8.08
2. Toyota Avanza memiliki jarak 8.37
3. Daihatsu Alya memiliki jarak 8.6

Manhattan Distance
1. Daihatsu Xenia memiliki jarak 16.83
2. Karimun memiliki jarak 16.88
3. Daihatsu Alya memiliki jarak 16.89

Minkowski Distance
1. Daihatsu Xenia memiliki jarak 8.08
2. Toyota Avanza memiliki jarak 8.37
3. Daihatsu Alya memiliki jarak 8.6

Supremum Distance
1. Daihatsu Xenia memiliki jarak 5.0
2. Toyota Avanza memiliki jarak 5.0
3. Daihatsu Alya memiliki jarak 6.0